import 'package:flutter/material.dart';

class TermsAndConditionView extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('شروط وأحكام تطبيق اصولي'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                '## **شروط وأحكام تطبيق اصولي**',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 18),
              ),
              SizedBox(height: 10),
              Text(
                '**قبول الاتفاقية**\n'
                'يُعد دخولك واستخدامك لتطبيق "اصولي" موافقةً دون قيد أو شرط على بنود وشروط الاستخدام هذه، بالإضافة إلى القوانين المعمول بها في المملكة العربية السعودية. تسري هذه الشروط من أول استخدام لك للتطبيق، وأي تعديل عليها يعد نافذًا فور إعلانه. استمرارك في استخدام التطبيق بعد إعلان أي تعديل يُعتبر قبولًا تامًا لذلك التعديل.',
              ),
              SizedBox(height: 10),
              Text(
                '**القيود على الاستخدام**\n'
                'باستخدامك لتطبيق "اصولي"، فإنك توافق على عدم:',
              ),
              SizedBox(height: 10),
              Text(
                '* تحميل أو مشاركة أي محتوى غير قانوني أو ضار.\n'
                '* استخدام التطبيق لأي غرض غير مشروع أو مخالف للقانون.\n'
                '* القيام بأي عمل يضر بالتطبيق أو يؤثر على أدائه.\n'
                '* استخدام أي أداة أو برنامج للتأثير على عمل التطبيق.\n'
                '* تحميل التطبيق بأعباء غير معقولة.\n'
                '* نشر أو توزيع أي محتوى مسيء أو غير لائق.',
              ),
              SizedBox(height: 10),
              Text(
                '**حقوق الملكية**\n'
                'جميع الحقوق في هذا التطبيق مملوكة لتطبيق "اصولي". لا يجوز لك نسخ، تعديل، توزيع، أو استخدام أي جزء من التطبيق أو محتواه دون الحصول على موافقة خطية مسبقة من "اصولي".',
              ),
              SizedBox(height: 10),
              Text(
                '**إخلاء المسؤولية**\n'
                'استخدامك لتطبيق "اصولي" على مسؤوليتك الخاصة. نحن في "اصولي" لسنا مسؤولين عن أي خسارة أو ضرر قد تتعرض له نتيجة استخدامك للتطبيق.',
              ),
              SizedBox(height: 10),
              Text(
                '**سياسة الخصوصية**\n'
                'باستخدامك لتطبيق "اصولي"، فإنك توافق على جمع ومعالجة واستخدام معلوماتك الشخصية وفقًا لسياسة الخصوصية الخاصة بنا.',
              ),
              SizedBox(height: 10),
              Text(
                '**رسوم الخدمات**\n'
                '[أدخل تفاصيل رسوم الخدمات وسياسة الاسترداد هنا]',
              ),
              SizedBox(height: 10),
              Text(
                '**إنهاء الاستخدام**\n'
                'نحتفظ بحق إنهاء أو تعليق حسابك دون إشعار مسبق في حال مخالفتك لشروط الاستخدام أو لأي سبب آخر.',
              ),
              SizedBox(height: 10),
              Text(
                '**تعديل الشروط**\n'
                'نحتفظ بحق تعديل شروط الاستخدام في أي وقت. سنقوم بإعلامك بأي تغييرات جوهرية.',
              ),
              SizedBox(height: 10),
              Text(
                '**اتصل بنا**\n'
                '[أدخل معلومات الاتصال الخاصة بك]',
              ),
              SizedBox(height: 10),
              Text(
                '**ملاحظة:**\n'
                'يجب مراجعة هذه الشروط والأحكام بشكل دوري للتأكد من فهمك لأي تغييرات.',
              ),
            ],
          ),
        ),
      ),
    );
  }
}
